; ═══════════════════════════════════════════════════════════════════════
;  ROM-ДИСК для Радио-86РК и подобных
; ═══════════════════════════════════════════════════════════════════════

	CPU		8080
	Z80SYNTAX	EXCLUSIVE

; ───────────────────────────────────────────────────────────────────────
; Адреса системных вызовов
; ───────────────────────────────────────────────────────────────────────

	INCLUDE	"syscalls.inc"

CHK	MACRO	adr, msg
		IF	$>(adr)
			ERROR	msg
		ENDIF
	ENDM

; ───────────────────────────────────────────────────────────────────────
; Блок 0. Инициализация BDOS
; ───────────────────────────────────────────────────────────────────────

	ORG	0

; ──────────────────────────────────────────────
; Блок защиты загрузки на Орион-128. Выводит
; сообщение, что данный диск предназначен для Радио-86РК.
; ──────────────────────────────────────────────

	PHASE	0B800H			; Адрес загрузки для ORDOS
ORDOSStart:
	LD	HL, MsgRKOnly		; адрес сообщения
	CALL	PrintString		; печать ASCIIZ
	JP	WarmBoot		; возврат в МОНИТОР
MsgRKOnly:
	DB	"|tot ROM-disk prednazna~en dlq radio-86rk, mikro-80", 0
	DEPHASE

; ──────────────────────────────────────────────
; Стандартная точка входа ORDOS
; ──────────────────────────────────────────────
	ORG	07FDH
	PHASE	0B7FDH
	JP	ORDOSStart		; переход на начало ORDOS
	DEPHASE
	CHK	0800H, "* Block overflow ! *"

; ───────────────────────────────────────────────────────────────────────
; Файловая система в формате ORDOS
; ───────────────────────────────────────────────────────────────────────
	ORG 0800H
FILE	MACRO name, start, size
	DB	(0fff0h-$) & 0fh dup (0)	; выравнивание по границе 16
s	SET	$
	DB	name				; имя файла
	DB	8-($-s) DUP (20H)		; дополнение пробелами до 8 символов
	DW	start				; адрес загрузки
	DW	size				; размер файла в байтах
	DB	080H				;
	DB	0,0,0				;
	ENDM

ENDOFFILES	MACRO
	DB	(0fff0h-$) & 0fh dup (0)	; выравнивание по границе 16
	DB	0FFH				; признак конца диска
	ENDM

	FILE "BASIC$", 0, 02000H
BASICROM:
	BINCLUDE "basic-rk86-micron-32kb.bin"

	if 0
	FILE "ASM$", 0, 01000H
EDASMROM:
	BINCLUDE "edasm.rom"

	FILE "DDT$", 6400H, 01000H
DPDDTROM:
	BINCLUDE "dpddt.rom"
	
	FILE "SORT$", 0, 0E96H
SORTUTROM:
	BINCLUDE "sortut.rom"

	FILE "LOAD$", 07400H, ENDLOADROM-LOADROM
LOADROM:
	BINCLUDE "load.rom"
ENDLOADROM:

	FILE "SAVE$", 07400H, ENDSAVEROM-SAVEROM
SAVEROM:
	BINCLUDE	"SAVE.ROM"
ENDSAVEROM:

	FILE "TEST$", 00100H, ENDTESTROM-TESTROM
TESTROM:
	BINCLUDE	"TEST.COM"
ENDTESTROM:

	ENDOFFILES
	endif

; ───────────────────────────────────────────────────────────────────────
; ПРОГРАММА УПРАВЛЕНИЯ ROM-DISK/32K
; В нашем случае программа работает на
; РК-86, МИКРО-80. Возможно и другие ПК.
; Грузиться и запускаться может с любого адреса.
; ───────────────────────────────────────────────────────────────────────

	ORG	07E00H

	BINCLUDE "romctrl.rom"

	CHK	08000H, "* Block overflow ! *"

	ORG	08000H
; ───────────────────────────────────────────────────────────────────────
; Остальная часть ROM-DISK, если поддерживается 64Кб.
; При размере больше 32Кб программа управления должна быть
; оформлена как файл, но оставаться на адресах 7E00H.
; ───────────────────────────────────────────────────────────────────────
	
	CHK	10000H, "* Block overflow ! *"

	END 				;
