	CPU		8080
	Z80SYNTAX	EXCLUSIVE

; ───────────────────────────────────────────────────────────────────────
; Адреса системных вызовов
; ───────────────────────────────────────────────────────────────────────

	INCLUDE	"syscalls.inc"

; ПРОГРАММА СЧИТЫВАНИЯ ФАЙЛА ИЗ ВРЕМЕННОГО БУФЕРА 
; В ТЕКСТОВЫЙ БУФЕР РЕДАКТОРА "МИКРОН". 
	ORG	07400H
	LD     HL,4A00H	;НАЧАЛЬНЫЙ АДРЕС 
	LD     DE,2100H	;BPEMEHHOГO БУФЕРА. 
	LD     BC,28FFH	;OБЪEM ФАЙЛА. 
RD1:	LD     A,(HL)   	;ПЕРЕСЛАТЬ
	LD	(DE),A     	;ФАЙЛ 
	INC     HL     	;И3
	INC     DE     	;ВРЕМЕННОГО БУФЕРА 
	DEC     BC     	;B ТЕКСТОВЫЙ БУФЕР 
	LD     A,B   	;С АДРЕСА 2100Н. 
	OR     C     	; 
	JP	NZ,     RD1   	; 
	JP	WarmBoot
